HenryHet2DHighVar/transient/0/K
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
20000
(
(4.77095e-09 0 0 4.77095e-09 0 4.77095e-09)
(1.50551e-08 0 0 1.50551e-08 0 1.50551e-08)
(4.32707e-08 0 0 4.32707e-08 0 4.32707e-08)
(4.63203e-08 0 0 4.63203e-08 0 4.63203e-08)
(1.10357e-08 0 0 1.10357e-08 0 1.10357e-08)
(7.72949e-10 0 0 7.72949e-10 0 7.72949e-10)
(3.8812e-11 0 0 3.8812e-11 0 3.8812e-11)
(3.43411e-12 0 0 3.43411e-12 0 3.43411e-12)
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
