HenryHet2DHighVar/transient/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
20000
(
(9.44161e-05 0 -2.84161e-05)
(0.000134923 0 -1.20907e-05)
(0.000144609 0 2.40409e-06)
(0.00011505 0 2.71548e-05)
(5.48507e-05 0 3.30446e-05)
(1.19867e-05 0 9.81938e-06)
(1.21758e-06 0 9.49736e-07)
(1.86387e-07 0 8.14591e-08)
...
)
;

boundaryField
{
    left
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
100
(
(9.44161e-05 0 -2.84161e-05)
(6.02196e-05 0 -5.10518e-05)
(4.24828e-05 0 -2.17543e-05)
(4.3296e-05 0 2.44669e-05)
(5.9081e-05 0 5.40898e-05)
(9.122e-05 0 3.57888e-05)
(6.82707e-05 0 8.29796e-06)
(4.68758e-05 0 2.51514e-05)
...
)
;
    }
    right
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
100
(
(-0.000241525 0 9.65069e-05)
(7.81207e-05 0 0.000130016)
(2.51197e-05 0 5.39214e-05)
(-4.61326e-06 0 4.11603e-05)
(-6.37196e-05 0 5.19764e-05)
(-7.42316e-05 0 7.2892e-05)
(-2.42271e-05 0 8.28568e-05)
(-4.67555e-05 0 8.9031e-05)
...
)
;
    }
    bottom
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(9.44161e-05 0 -2.84161e-05)
(0.000134923 0 -1.20907e-05)
(0.000144609 0 2.40409e-06)
(0.00011505 0 2.71548e-05)
(5.48507e-05 0 3.30446e-05)
(1.19867e-05 0 9.81938e-06)
(1.21758e-06 0 9.49736e-07)
(1.86387e-07 0 8.14591e-08)
...
)
;
    }
    top
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(4.84572e-05 0 -1.75428e-05)
(3.09223e-05 0 7.74126e-09)
(3.31631e-05 0 2.23298e-06)
(2.73407e-05 0 -8.05549e-06)
(1.09836e-05 0 -8.3017e-06)
(1.43383e-06 0 -1.24807e-06)
(1.12839e-07 0 -7.29292e-08)
(4.90359e-08 0 9.12579e-09)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
