HenryHet2DHighVar/transient/0/c.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

c0 0.0357;

internalField   uniform 0;

boundaryField
{
     left
    {
        type            fixedValue;
    	value           uniform 0.0;
    }
    right
    {
        type            fixedTransportFlux;
        advectiveValue  uniform $c0;
        D               uniform 6.6e-6; 
        diffusiveValue  uniform $c0;
        diffusiveFactor uniform 1;
        inletDiffusion  false;
        //type          fixedValue;
        //type          inletOutlet;
        inletValue      uniform $c0;
        value           uniform $c0;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
