HenryHet2DHighVar/transient/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20000
(
9978.23
9978.06
9977.99
9977.96
9977.91
9977.76
9977.46
9977.04
...
)
;

boundaryField
{
    left
    {
        type            darcyFixedVelocity;
        gradient        nonuniform List<scalar> 
100
(
13.8337
62.1592
631.797
895.693
123.841
16.9549
25.4049
157.452
...
)
;
        velocity        6.6e-05;
    }
    right
    {
        type            codedFixedValue;
        value           nonuniform List<scalar> 
100
(
9994.68
9894.23
9793.78
9693.33
9592.88
9492.43
9391.98
9291.53
...
)
;
        name            right;
        code            #{
            
            scalarField myPatch(this->patch().size());
            forAll(this->patch().Cf(),i)
            {
              myPatch[i]= 1024.99*9.8*(1. - this->patch().Cf()[i].z());
            }
            operator==(myPatch);
        #};
        codeInclude     #{
            #include "uniformDimensionedFields.H"
        #};
        codeOptions     #{
            -I$(LIB_SRC)/finiteVolume/lnInclude
        #};
    }
    bottom
    {
        type            darcyFixedVelocity;
        gradient        uniform 9800;
        velocity        0;
    }
    top
    {
        type            darcyFixedVelocity;
        gradient        uniform -9800;
        velocity        0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
