HenryHet2DHighVar/transient/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          100;
        startFace       39700;
    }
    right
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    bottom
    {
        type            patch;
        nFaces          200;
        startFace       39900;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       40100;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       40300;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       60300;
    }
)

// ************************************************************************* //
